package com.sixeyes.client.api.render;

public interface Batchable {
    void begin();

    // Р С›РЎвЂљРЎР‚Р С‘РЎРѓР С•Р Р†РЎвЂ№Р Р†Р В°Р ВµРЎвЂљ Р Р†РЎРѓРЎвЂ, РЎвЂЎРЎвЂљР С• Р Р…Р В°Р С”Р С•Р С—Р С‘Р В»Р С•РЎРѓРЎРЉ Р Р† Р С”Р С•Р Р…Р С”РЎР‚Р ВµРЎвЂљР Р…Р С•Р С Р С—Р В°Р в„–Р С—Р В»Р В°Р в„–Р Р…Р Вµ
    void flush(RenderPipeline pipeline);

    void end(); // Р СљР С•Р В¶Р Р…Р С• Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉ Р Т‘Р В»РЎРЏ Р С•РЎвЂЎР С‘РЎРѓРЎвЂљР С”Р С‘, Р ВµРЎРѓР В»Р С‘ Р Р…РЎС“Р В¶Р Р…Р С•
}


