package com.sixeyes.client.api.render;

public enum RenderPipeline {
    BACKGROUND, // Р В Р С‘РЎРѓРЎС“Р ВµРЎвЂљРЎРѓРЎРЏ Р С—Р ВµРЎР‚Р Р†РЎвЂ№Р С (РЎвЂћР С•Р Р…)
    GAME,       // Р С›Р В±РЎвЂ№РЎвЂЎР Р…РЎвЂ№Р Вµ РЎРЊР В»Р ВµР СР ВµР Р…РЎвЂљРЎвЂ№
    HUD,        // Р ВР Р…РЎвЂљР ВµРЎР‚РЎвЂћР ВµР в„–РЎРѓ
    POPUP,      // Р вЂ™РЎРѓР С—Р В»РЎвЂ№Р Р†Р В°РЎв‚¬Р С”Р С‘
    CURSOR;     // Р В Р С‘РЎРѓРЎС“Р ВµРЎвЂљРЎРѓРЎРЏ Р С—Р С•РЎРѓР В»Р ВµР Т‘Р Р…Р С‘Р С (Р С—Р С•Р Р†Р ВµРЎР‚РЎвЂ¦ Р Р†РЎРѓР ВµР С–Р С•)

    // Р СљР В°РЎРѓРЎРѓР С‘Р Р† Р Т‘Р В»РЎРЏ Р В±РЎвЂ№РЎРѓРЎвЂљРЎР‚Р С•Р С–Р С• Р Т‘Р С•РЎРѓРЎвЂљРЎС“Р С—Р В° Р В±Р ВµР В· values() Р С”Р В°Р В¶Р Т‘РЎвЂ№Р в„– РЎР‚Р В°Р В·
    public static final RenderPipeline[] VALUES = values();
}

